python_pytorch_lightning.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-15 Thu 01:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python - Pytorch Lightning</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python - Pytorch Lightning</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org80231ba">Installation</a></li>
<li><a href="#org957716c">Usage</a>
<ul>
<li><a href="#org7c67afe">Neural network</a></li>
<li><a href="#org3f6cd71">Data module</a></li>
<li><a href="#org052f340">Procedure</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://github.com/Lightning-AI/lightning"><i>Pytorch Lightning</i></a> is a high level framework and encapsulation on top of pytorch, which provides simplified interfaces and elegant code structure relating to AI. Detailed usage can be found in its <a href="https://pytorch-lightning.readthedocs.io/en/stable">manual</a>.
</p>

<div id="outline-container-org80231ba" class="outline-2">
<h2 id="org80231ba">Installation</h2>
<div class="outline-text-2" id="text-org80231ba">
<p>
The installation of Pytorch Lightning is very simple. Taking <i>pip</i> for instance, following command completes the procedure.
</p>
<div class="org-src-container">
<pre class="src src-shell">pip install pytorch-lightning
</pre>
</div>
</div>
</div>
<div id="outline-container-org957716c" class="outline-2">
<h2 id="org957716c">Usage</h2>
<div class="outline-text-2" id="text-org957716c">
</div>
<div id="outline-container-org7c67afe" class="outline-3">
<h3 id="org7c67afe">Neural network</h3>
<div class="outline-text-3" id="text-org7c67afe">
<p>
The structure of neural network can be defined as a subclass of <code>pytorch_lightning.LightningModule</code>, which is essentially a subclass of <code>torch.nn.Module</code>. Besides the constructor <code>__init__</code> and function <code>forward</code>, a series of hook functions has been defined and can be simply overridden, e.g.,
</p>
<ul class="org-ul">
<li><code>configure_optimizers</code> can be used to further tweak the behavior of the optimizer, e.g., the initial value of learning rate and how it is decaying.</li>
<li><code>on_train_start</code>, <code>on_validation_start</code>, and <code>on_test_start</code> are the hook functions provoked at the beginning of training, validating, and testing, respectively.</li>
<li><code>on_train_end</code>, <code>on_validation_end</code>, and <code>on_test_end</code> are the hook functions provoked at the end of training, validating, and testing, respectively.</li>
<li><code>training_step</code>, <code>validation_step</code>, and <code>test_step</code> are the hook functions provoked for each batch in training, validating, and testing respectively, e.g., in which loss function is calculated.</li>
<li><code>training_epoch_end</code>, <code>validation_epoch_end</code>, and <code>test_epoch_end</code> are the hook functions provoked at the end of each epoch in training, validating, and testing respectively.</li>
</ul>
</div>
</div>
<div id="outline-container-org3f6cd71" class="outline-3">
<h3 id="org3f6cd71">Data module</h3>
<div class="outline-text-3" id="text-org3f6cd71">
<p>
In <code>python_lightning</code>, a <i>data module</i> class is defined in <code>python_lightning.LightningDataModule</code>, which provides a unified interface for data loading for training, validating, and testing. We can simply define our own data module as a subclass of <code>python_lightning.LightningDataModule</code>, and override the following functions.
</p>
<ul class="org-ul">
<li><code>setup</code> can define one or more datasets needed.</li>
<li><code>train_dataloader</code>, <code>val_dataloader</code>, and <code>test_dataloader</code> return separate dataloaders for training, validating and testing, respectively.</li>
</ul>
</div>
</div>
<div id="outline-container-org052f340" class="outline-3">
<h3 id="org052f340">Procedure</h3>
<div class="outline-text-3" id="text-org052f340">
<p>
The main procedure is completed based on an instance of class <code>python_lightning.Trainer</code>. In its constructor, we can customize it via a series of keyword arguments, e.g.,
</p>
<ul class="org-ul">
<li><code>default_root_dir</code> indicates the output directory.</li>
<li><code>max_epochs</code> is the maximum number of epochs.</li>
<li><code>check_val_every_n_epoch</code> is the period of validation in epoch number.</li>
<li><code>logger</code> is object for logging, e.g., <code>python_lightning.loggers.TensorBoardLogger</code>.</li>
<li><code>enable_progress_bar</code> is a boolean indicator of progress bar.</li>
<li><code>strategy</code> defines the training type, e.g., <code>DDP</code>, <code>DDP2</code>.</li>
<li><code>gpus</code> indicates the identities of selected GPU(s).</li>
</ul>

<p>
The training and testing can be finished by calling its member functions, e.g.,
</p>
<ul class="org-ul">
<li><code>fit</code> for training.</li>
<li><code>test</code> for testing.</li>
<li><code>save_checkpoint</code> to save the state of the <code>python_lightning.Trainer</code> object, including the coefficients or weights of the trainable parameters in the neural network.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
